USE [CultureGR]
GO

/****** Object:  Table [dbo].[MSM]    Script Date: 11/1/2025 11:25:05 ******/
SET ANSI_NULLS ON
GO

SET QUOTED_IDENTIFIER ON
GO

CREATE TABLE [dbo].[MSM](
	[mus_id] [int] NOT NULL,
	[mus_name] [nvarchar](50) NULL,
	[mus_desc] [text] NULL,
	[mus_address] [text] NULL,
	[mus_latitude] [text] NULL,
	[mus_longitude] [text] NULL,
	[mus_lati_int] [float] NULL,
	[mus_long_ind] [float] NULL,
	[mus_phone] [nchar](20) NULL,
 CONSTRAINT [PK_MSM] PRIMARY KEY CLUSTERED 
(
	[mus_id] ASC
)WITH (PAD_INDEX = OFF, STATISTICS_NORECOMPUTE = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS = ON, ALLOW_PAGE_LOCKS = ON, OPTIMIZE_FOR_SEQUENTIAL_KEY = OFF) ON [PRIMARY]
) ON [PRIMARY] TEXTIMAGE_ON [PRIMARY]
GO


insert into MSM(mus_id, mus_name, mus_desc, mus_address, mus_latitude, mus_longitude, mus_lati_int, mus_long_ind, mus_phone)
values
(1, 'Αρχαιολογικό Μουσείο Αλεξανδρούπολης', 'Στη μόνιμη έκθεσή του παρουσιάζονται ευρήματα που αφηγούνται την ιστορία της περιοχής από τους προϊστορικούς έως και τους ρωμαϊκούς χρόνους και προέρχονται από το χερσαίο τμήμα της Περιφερειακής Ενότητας Έβρου. Σύντομα κείμενα, χάρτες, φωτογραφίες και σχέδια παρέχουν τις απαραίτητες για την περιήγηση του επισκέπτη πληροφορίες, ενώ βιντεοπροβολές και πολυμεσικές εφαρμογές εμπλουτίζουν τη μουσειακή εμπειρία.', 'Λεωφόρος Μάκρης 44, Αλεξανδρούπολη 68131', '40.84768019209099', '25.856997966786974', 40.84768019209099, 25.856997966786974, '(+30)2551026103'),
(2, 'Αρχαιολογικό Μουσείο Αβδήρων', 'To Αρχαιολογικό Μουσείο Αβδήρων παρουσιάζει την εξέλιξη της πόλης των Αβδήρων από την ίδρυσή της τον 7ο αι. π.Χ. μέχρι τον 12ο αι. μ.Χ. Τα εκθέματά του μαρτυρούν τόσο τον τρόπο ζωής και τον πολιτισμό των αρχαίων Αβδηριτών όσο και τον ρόλο που διαδραμάτισε η πόλη στην περιοχή της Θράκης αλλά και στον αρχαίο ελληνικό κόσμο.', 'Δ. Λαζαρίδη 2, ’βδηρα 67061', '40.9810199', '24.9537921', 40.9810199, 24.9537921, '(+30) 2541051003'),
(3, 'Αρχαιολογικό Μουσείο Δράμας', 'το Αρχαιολογικό Μουσείο Δράμας επιχειρεί να σκιαγραφήσει την πολιτιστική φυσιογνωμία της ευρύτερης περιοχής της Περιφερειακής Ενότητας Δράμας διαχρονικά, καθώς στις αίθουσές του παρουσιάζονται ευρήματα από τη μέση παλαιολιθική περίοδο (50.000 χρόνια από σήμερα) έως τους νεότερους χρόνους.', 'Πατριάρχου Διονυσίου 2, Δράμα 66133', '41.1479538', '24.1433015', 41.1479538, 24.1433015, '(+30) 2521031365'),
(4, 'Αρχαιολογικό Μουσείο Καβάλας', 'Στην έκθεσή του παρουσιάζεται η ιστορία της Καβάλας από την ίδρυσή της τον 7ο αι π.Χ. (Νεάπολη) έως το τέλος των βυζαντινών χρόνων (Χριστούπολη), καθώς και της ευρύτερης περιοχής της.', 'Ερυθρού Σταυρού 17, Καβάλα 65110', '40.93570225', '24.4037281081839', 40.93570225, 24.4037281081839, '(+30) 2510222335'),
(5, 'Μουσείο Γουλανδρή Φυσικής Ιστορίας', 'Το Μουσείο Γουλανδρή Φυσικής Ιστορίας (Μ.Γ.Φ.Ι.) ιδρύθηκε το 1964 από τον ’γγελο Γουλανδρή και τη Νίκη Γουλανδρή, αποτελεί το πρώτο μουσείο φυσικής ιστορίας στην Ελλάδα και τον πρώτο ελληνικό φορέα που καθιέρωσε την περιβαλλοντική εκπαίδευση.', 'Λεβίδου 13 και Όθωνος 100, 145 62 Κηφισιά', '38.07437', '23.81466', '210 8015870');
GO

DELETE  FROM MSM
GO

SELECT * FROM MSM
GO