USE [CultureGR]
GO

/****** Object:  Table [dbo].[TIME_PERIODS]    Script Date: 4/1/2025 17:30:24 ******/
SET ANSI_NULLS ON
GO

SET QUOTED_IDENTIFIER ON
GO

CREATE TABLE [dbo].[TIME_PERIODS](
	[p_id] [int] NOT NULL,
	[per_name] [nvarchar](50) NULL,
	[per_time_start] [text] NULL,
	[per_time_end] [text] NULL,
 CONSTRAINT [PK_TIME_PERIODS] PRIMARY KEY CLUSTERED 
(
	[p_id] ASC
)WITH (PAD_INDEX = OFF, STATISTICS_NORECOMPUTE = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS = ON, ALLOW_PAGE_LOCKS = ON, OPTIMIZE_FOR_SEQUENTIAL_KEY = OFF) ON [PRIMARY]
) ON [PRIMARY] TEXTIMAGE_ON [PRIMARY]
GO

SELECT * FROM TIME_PERIODS
ORDER BY p_id asc;
GO

DELETE FROM TIME_PERIODS
GO

INSERT INTO TIME_PERIODS(p_id, per_name, per_time_start, per_time_end)
VALUES
	(1,'Μεσολιθική Ελλάδα','13.000 π.Χ.','7.000 π.Χ.'),
	(2,'Νεολιθική Ελλάδα','7.000 π.Χ.','3.200 π.Χ.'),
	(3,'Κυκλαδικός πολιτισμός','πριν το 3050 π.Χ.','1100 π.Χ.'),
	(4,'Μινωικός πολιτισμός','πριν το 3000 π.Χ.','1420 π.Χ.'),
	(5,'Αιγαιακός πολιτισμός','πριν το 1600 π.Χ.','1420 π.Χ.'),
	(6,'Μυκηναϊκός πολιτισμός','περίπου 1600 π.Χ.','1100 π.Χ.'),
	(7,'Γεωμετρική Εποχή','1100','800 π.Χ.'),
	(8,'Αρχαϊκή εποχή','περίπου 800 π.Χ.','περίπου 479 π.Χ.'),
	(9,'Κλασική εποχή','περίπου 479 π.Χ.','323 π.Χ.'),
	(10,'Ελληνιστική περίοδος','323','146 π.Χ.'),
	(11,'Ρωμαϊκή περίοδος','146 π.Χ.','330 μ.Χ.'),
	(12, 'Βυζαντινή περίοδος','330 μ.Χ.','1453 μ.Χ.'),
	(13, 'Αναγέννηση', '1453', '1600'),
	(14, 'Μεταβυζαντινή', '1453', '1821'),
	(15, 'Σύχρονη και Νεότερη Ιστορία', '1821', 'Σήμερα');
GO

ALTER TABLE [dbo].[TIME_PERIODS]
ADD per_desc TEXT NULL;
GO


UPDATE [dbo].[TIME_PERIODS]
SET per_desc = 'Με τον όρο μεσολιθική Ελλάδα εννοούμε τη μεσολιθική περίοδο για την Ελλάδα, όπως αυτή προκύπτει από την επιστημονική μελέτη και ανάλυση των ευρημάτων των ερευνών αυτής περιόδου, που είναι εντοπισμένες στον ελληνικό γεωγραφικό χώρο. Σημειώνεται ότι η μεσολιθική περίοδος (περίπου 10000-6000 π.Χ.) είναι η ενδιάμεση ανάμεσα στην παλαιολιθική (περίπου 40000-10000 π.Χ. για την Ελλάδα), και τη νεολιθική περίοδο (περίπου 6000-2600 π.Χ. για την Ελλάδα), και δεν πρέπει να συγχέεται με τη μέση παλαιολιθική ή τη μέση νεολιθική περίοδο.'
WHERE p_id = 1;

UPDATE [dbo].[TIME_PERIODS]
SET per_desc = 'Με τον όρο νεολιθική Ελλάδα αναφερόμαστε στη νεολιθική περίοδο για την Ελλάδα, στις δραστηριότητες δηλαδή των κατοίκων του ελληνικού γεωγραφικού χώρου κατά την περίοδο αυτή. Σημειώνεται ότι η νεολιθική περίοδος είναι η ενδιάμεση ανάμεσα στην επιπαλαιολιθική ή μεσολιθική περίοδο (περίπου 10000-7000 π.Χ. για την Ελλάδα) και την εποχή του χαλκού (περίπου 3000-1100 π.Χ. για την Ελλάδα). Κατά τη διάρκεια της Ελληνικής νεολιθικής περιόδου αναπτύχθηκαν οι πρώτοι οργανωμένοι οικισμοί, η βασική γενική οικονομία δημιουργήθηκε, η αρχιτεκτονική βελτιώθηκε και παρατηρήθηκαν οι πρώτες αμυντικές κατασκευές.'
WHERE p_id = 2;

UPDATE [dbo].[TIME_PERIODS]
SET per_desc = 'Την ονομασία Κυκλάδες χρησιμοποίησαν οι αρχαίοι Έλληνες συγγραφείς για να χαρακτηρίσουν το πυκνό σύμπλεγμα των μικρών νησιών στο κέντρο του Αιγαίου πελάγους, τα οποία φαίνονται να σχηματίζουν έναν νοητό κύκλο γύρω από το ιερό νησί τους και τόπο λατρείας του Απόλλωνα, τη Δήλο. Τα νησιά αυτά υπήρξαν το λίκνο ενός σημαντικού πολιτισμού, του λεγόμενου Κυκλαδικού πολιτισμού, που άνθησε κατά την 3η χιλιετία π.X.'
WHERE p_id = 3;

UPDATE [dbo].[TIME_PERIODS]
SET per_desc = 'Ο μινωικός πολιτισμός είναι αξιοσημείωτος για τα μεγάλα και περίτεχνα ανάκτορα του, ύψους έως και τεσσάρων ορόφων, με περίπλοκα υδραυλικά δίκτυα και τοιχογραφίες. Η Μινωική περίοδος χαρακτηρίζεται από εκτεταμένο εμπόριο μεταξύ των οικισμών στην Κρήτη, στο Αιγαίου και στην Μεσόγειο ιδιαίτερα στην Ανατολή.'
WHERE p_id = 4;

UPDATE [dbo].[TIME_PERIODS]
SET per_desc = 'Οι Αιγαιακοί πολιτισμοί είναι ένας γενικός όρος που χρησιμοποιείται για τους πολιτισμούς της εποχής του Χαλκού στον αιγαιακό χώρο. Στην πραγματικότητα ο όρος καλύπτει τρεις περιοχές: τα νησιά του Αιγαίου, την Κρήτη και την ηπειρωτική Ελλάδα. Η Κρήτη από την Πρώιμη Εποχή του Χαλκού συνδέεται με το Μινωικό πολιτισμό, ενώ στις Κυκλάδες και στην ηπειρωτική Ελλάδα υπάρχουν διάφοροι πολιτισμοί. Οι Κυκλάδες βρέθηκαν σε στενή επικοινωνία με την κυρίως Ελλάδα κατά την πρωτοελλαδική Μινυακή περίοδο και με την Κρήτη τη Μινωική περίοδο. Από περίπου το 1450 π.Χ., ο πρωτοελληνικός Μυκηναϊκός πολιτισμός εξαπλώνεται στην Κρήτη.'
WHERE p_id = 5;

UPDATE [dbo].[TIME_PERIODS]
SET per_desc = 'Ο Μυκηναϊκός Πολιτισμός αφορά τον πολιτισμό της Ύστερης Εποχής του Χαλκού, που αναπτύχθηκε το 1700–1100 π.Χ κυρίως στην κεντρική, νότια ηπειρωτική και νησιωτική Ελλάδα. Αντιπροσωπεύει τον πρώτο εξελιγμένο και ξεχωριστό ελληνικό πολιτισμό στην ηπειρωτική Ελλάδα, με τα παλάτια, την αστική οργάνωση, τα έργα τέχνης και το σύστημα γραφής (Γραμμική Β)  και αποδείχθηκε ότι η Γραμμική Β ήταν ελληνική γραφή. Το επίθετο «μυκηναϊκός» προέρχεται από την πρώτη αρχαιολογική θέση στην οποία εντοπίστηκε, τις Μυκήνες της Αργολίδας, που αποτελούν και ένα από τα σημαντικότερα κέντρα του.  Ο Μυκηναϊκός Πολιτισμός ταυτίζεται με την Υστεροελλαδική περίοδο. Ταξινομείται παραδοσιακά ως προϊστορικός, καθώς οι γνώσεις μας για αυτόν βασίζονται μέχρι σήμερα κυρίως σε αρχαιολογικά ευρήματα.'
WHERE p_id = 6;

UPDATE [dbo].[TIME_PERIODS]
SET per_desc = 'Η περίοδος αυτή πέρα από «σκοτεινοί αιώνες», είναι γνωστή και με άλλες ονομασίες, όπως ομηρική εποχή, γεωμετρική εποχή, λόγω των αλλαγών που σημειώνονται περί το 1050 π.Χ. στην τεχνοτροπία της κεραμικής, ή εποχή του σιδήρου, καθώς από το 1100 π.Χ. και εξής γενικεύεται η χρήση του υλικού αυτού για την κατασκευή όπλων ή σκευών.'
WHERE p_id = 7;

UPDATE [dbo].[TIME_PERIODS]
SET per_desc = 'Την περίοδο αυτή οι πηγές αυξάνονται. Οι πηγές της εποχής εκπροσωπούνται από : τη λογοτεχνική παραγωγή της εποχής, δηλαδή, την επική και τη λυρική ποίηση και τα πεζά λογοτεχνικά έργα τους καταλόγους βασιλέων και αρχόντων και τις σωζόμενες επιγραφές. Από μεταγενέστερες πηγές, έχουμε γραμματειακές πηγές από τον 5ο π.Χ. αιώνα και εξής.'
WHERE p_id = 8;

UPDATE [dbo].[TIME_PERIODS]
SET per_desc = 'Με τον ορισμό της κλασικής εποχής αναφέρεται η χρονική περίοδος της αρχαίας ελληνικής ιστορίας, περίπου 200 χρόνων, από το 480 π.Χ. έως το 323 π.Χ., κατά την οποία υπήρξε ραγδαία άνθιση στον χώρο του πολιτισμού. Πήρε το όνομά της από τα υψηλά επιτεύγματα που σημειώθηκαν εκείνη την περίοδο.'
WHERE p_id = 9;

UPDATE [dbo].[TIME_PERIODS]
SET per_desc = 'Στην κλασική αρχαιότητα, η ελληνιστική περίοδος καλύπτει το χρονικό διάστημα της ελληνικής ιστορίας μετά την αρχαία Ελλάδα, μεταξύ του θανάτου του Μεγάλου Αλεξάνδρου το 323 π.Χ. και του θανάτου της Κλεοπάτρας Ζ΄ (30 π.Χ.), ακολουθούμενο από την εμφάνιση της Ρωμαϊκής Αυτοκρατορίας, όπως σηματοδοτείται από τη Ναυμαχία του Ακτίου το 31 π.Χ. και την κατάκτηση του Πτολεμαϊκού Βασιλείου τον επόμενο χρόνο.] Η αρχαία ελληνική λέξη Ἑλλάς αναγνωρίστηκε σταδιακά ως η ονομασία της Ελλάδας, από την οποία προήλθε η λέξη ελληνιστική.'
WHERE p_id = 10;

UPDATE [dbo].[TIME_PERIODS]
SET per_desc = 'Η Ρωμαϊκή Αυτοκρατορία (Imperium Rōmānum) ήταν το κράτος των αρχαίων Ρωμαίων έπειτα από την περίοδο της Ρωμαϊκής Δημοκρατίας, το οποίο χαρακτηρίζεται από κυβέρνηση με επικεφαλής τους αυτοκράτορες και με μεγάλες εδαφικές κατακτήσεις γύρω από τη Μεσόγειο Θάλασσα στην Ευρώπη, την Αφρική και την Ασία.'
WHERE p_id = 11;

UPDATE [dbo].[TIME_PERIODS]
SET per_desc = 'Οι όροι Βυζαντινή Αυτοκρατορία (ή απλά Βυζάντιο) και Ανατολική Ρωμαϊκή Αυτοκρατορία, αναφέρονται στο ιστορικό κράτος με επίσημο όνομα Βασιλεία Ρωμαίων (μεσ. ελληνικά: Βασιλεία Ῥωμαίων, λατινικά: Imperium Romanum), γνωστό και ως Ρωμανία (μεταγενέστερα χαρακτηρίσθηκε και Αυτοκρατορία των Ελλήνων, το 1791 στο έργο "Γεωγραφία Νεωτερική"). Το πολίτευμα του κράτος ήταν αυτοκρατορία, πρωτεύουσα είχε την Κωνσταντινούπολη, και αποτέλεσε την συνέχεια της Ρωμαϊκής Αυτοκρατορίας. Τα χρονικά όρια της Βυζαντινής αυτοκρατορίας ξεκινούν από τα εγκαίνια της Κωνσταντινούπολης στις 11 Μαΐου 330 και φτάνουν ως την τελική της πτώση, την Άλωση από τους Οθωμανούς, στις 29 Μαΐου 1453.'
WHERE p_id = 12;

UPDATE [dbo].[TIME_PERIODS]
SET per_desc = 'Η Αναγέννηση είναι μια περίοδος της Ευρωπαϊκής ιστορίας που σηματοδοτεί τη μετάβαση από τον Μεσαίωνα στη νεωτερικότητα και καλύπτει τον 15ο και τον 16ο αιώνα και χαρακτηρίζεται από μια προσπάθεια αναβίωσης και υπέρβασης ιδεών και επιτευγμάτων της κλασικής αρχαιότητας. Συνέβη μετά την Κρίση του Ύστερου Μεσαίωνα και συνδέθηκε με μεγάλες κοινωνικές αλλαγές. Εκτός από την τυπική περιοδοποίηση οι υποστηρικτές μιας «μακράς Αναγέννησης» τοποθετούν την αρχή της στον 14ο και το τέλος της στον 17ο αιώνα.'
WHERE p_id = 13;

UPDATE [dbo].[TIME_PERIODS]
SET per_desc = 'Η Μεταβυζαντινή περίοδος (1453-1821) αρχίζει με την άλωση της Κωνσταντινούπολης από τους Οθωμανούς Τούρκους, η οποία έβαλε τέλος στη ζωή της Βυζαντινής αυτοκρατορίας ως κρατικής οντότητας. Ωστόσο, αυτή η βίαιη τομή ήταν η αρχή για ένα νέο κεφάλαιο στην ιστορία του ελλαδικού χώρου, που χαρακτηρίζεται από την επιβίωση της βυζαντινής κληρονομιάς στους υπόδουλους Έλληνες.'
WHERE p_id = 14;

UPDATE [dbo].[TIME_PERIODS]
SET per_desc = 'Η Ιστορία της νεότερης Ελλάδας αρχίζει ουσιαστικά από το 1821 και την ανεξαρτησία του Ελληνικού κράτους το έτος 1828 με κυβερνήτη τον Ιωάννη Καποδίστρια καλύπτοντας την Πελοπόννησο και μέρος της Στερεάς Ελλάδας. Από το 1832 μέχρι το 1974 το Ελληνικό κράτος ήταν βασίλειο (με διαστήματα χωρίς βασιλεία) και από το 1974, η σύγχρονη Ελλάδα απέκτησε το πολίτευμα της Δημοκρατίας, οδηγώντας έτσι στην Τρίτη Ελληνική Δημοκρατία.'
WHERE p_id = 15;
