INSERT INTO MUSEUMS (mus_name, mus_desc, mus_address, mus_coordinate, mus_phone, mus_open, categoty_id, period_id, mus_avg_rate, exhibit_id)
VALUES
	 ('Μουσείο Γουλανδρή Φυσικής Ιστορίας', 'Το Μουσείο Γουλανδρή Φυσικής Ιστορίας (Μ.Γ.Φ.Ι.) ιδρύθηκε το 1964 από τον ’γγελο Γουλανδρή και τη Νίκη Γουλανδρή, αποτελεί το πρώτο μουσείο φυσικής ιστορίας στην Ελλάδα και τον πρώτο ελληνικό φορέα που καθιέρωσε την περιβαλλοντική εκπαίδευση.', 'Λεβίδου 13 και Όθωνος 100, 145 62 Κηφισιά', geography::STPointFromText('POINT(38.07437 23.81466)', 4326), '210 8015870', 'Καθημερινά 09:00 - 16:00', 6, 13, 5, 6);
	GO
