INSERT INTO MUSEUMS (mus_name, mus_desc, mus_coordinate, mus_phone, mus_open, categoty_id, period_id, mus_avg_rate, exhibit_id)
VALUES
    ('Μουσείο της Ιστορίας των Ολυμπιακών Αγώνων',
     'Το Μουσείο της Ιστορίας των Ολυμπιακών Αγώνων της Αρχαιότητας φιλοξενεί πάνω από 400 αρχαία έργα...',
     geography::STPointFromText('POINT(29.119 30.26240)', 4326),
     
     '(+30) 26240 23964',
     'Καθημερινά: 08:30 - 15:30',
     10, 4, 5, 2),
    
    ('Αρχαιολογικό Μουσείο Αλεξανδρούπολης',
     'Στη μόνιμη έκθεσή του παρουσιάζονται ευρήματα που αφηγούνται την ιστορία της περιοχής...',
     geography::STPointFromText('POINT(25.856997966 40.8476819)', 4326),
     
     '(+30) 25510 26103',
     '1/11-31/3: Δευτέρα-Κυριακή 08:30-15:30, Τρίτη κλειστά',
     1, 11, 4, 4),

    ('Αρχαιολογικό Μουσείο Αβδήρων',
     'To Αρχαιολογικό Μουσείο Αβδήρων παρουσιάζει την εξέλιξη της πόλης...',
     geography::STPointFromText('POINT(24.9537921 40.9810199)', 4326),
     
     '(+30) 25410 51003',
     '1/11-31/3: 08:30 - 15:30',
     1, 8, 3, 7),

    ('Αρχαιολογικό Μουσείο Δράμας',
     'Τα αρχαιολογικά ευρήματα καταγράφουν την πολιτιστική ιστορία της Δράμας...',
     geography::STPointFromText('POINT(24.1433015 41.1479538)', 4326),
     
     '(+30) 25210 31365',
     'Δευτέρα-Κυριακή 08:30-15:00',
     1, 2, 3, 13),

    ('Αρχαιολογικό Μουσείο Καβάλας',
     'Στην έκθεσή του παρουσιάζεται η ιστορία της Καβάλας από την ίδρυσή της...',
     geography::STPointFromText('POINT(24.4037281081839 40.93570225)', 4326),
     
     '(+30) 25102 22335',
     '1/11-31/3: 08:30 - 15:30, Τρίτη κλειστά',
     1, 12, 5, 11),
	 

	 INSERT INTO MUSEUMS (mus_name, mus_desc, mus_address, mus_coordinate, mus_phone, mus_open, categoty_id, period_id, mus_avg_rate, exhibit_id)
VALUES
	 ('Μουσείο Γουλανδρή Φυσικής Ιστορίας', 'Το Μουσείο Γουλανδρή Φυσικής Ιστορίας (Μ.Γ.Φ.Ι.) ιδρύθηκε το 1964 από τον ’γγελο Γουλανδρή και τη Νίκη Γουλανδρή, αποτελεί το πρώτο μουσείο φυσικής ιστορίας στην Ελλάδα και τον πρώτο ελληνικό φορέα που καθιέρωσε την περιβαλλοντική εκπαίδευση.', 'Λεβίδου 13 και Όθωνος 100, 145 62 Κηφισιά', geography::STPointFromText('POINT(38.07437 23.81466)', 4326), '210 8015870', 'Καθημερινά 09:00 - 16:00', 6, 13, 5, 6);
	 	 